Revit 2026 API

# MaterialMaterialCategory Property

---

The name of the material category, e.g. 'Wood'

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string MaterialCategory { get; set; }
```
```vb
Public Property MaterialCategory As String
	Get
	Set
```
```cpp
public:
property String^ MaterialCategory {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member MaterialCategory : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Material Class

Autodesk.Revit.DB Namespace